Tekla Open API Reference for Tekla Structures 2025
DrawingItem.Type Property
 The files belonging to drawing item.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingTypes Type { get; set; }
Public Property Type As DrawingTypes
	Get
	Set
Property Value
Type: DrawingTypes
See Also
Reference
DrawingItem Class
Tekla.Structures.Catalogs Namespace